INSERT INTO 街道办事处
	VALUES(01,'龙岗街道',13527272721,'上边'),
	(02,'双路街道',13527272722,'下边'),
	(03,'智凤街道',13527272723,'左边'),
	(04,'登云街道',13527272724,'右边')
	
INSERT INTO 小区
	VALUES('阳光水岸','龙岗一小下边','01'),
	('金色花园','双桥中央','02'),
	('绿地海棠湾','智凤13号','03'),
	('登云天棠','登云7号','04')
	
INSERT INTO 楼
	VALUES('阳光水岸','01','29','290'),
	('金色花园','01','30','300'),
	('绿地海棠湾','01','31','310'),
	('登云天棠','01','32','320')
	
INSERT INTO 住户
	VALUES('阳光水岸','01,1-1-1',100,'杨富敏'),
	('金色花园','01,1-2-1',100,'姜鹏'),
	('绿地海棠湾','01,1-3-1',1,'郭永红'),
	('登云天棠','01,1-4-1',100,'姜婷')