// q2.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>

int main()
{
    //std::cout << "18074102 左帅 上机题二\n请输入表达式:\n(11+(12+3)/5)*2-5\n中缀->后缀:\n11123+5/+2*5-\n后缀求值:23"<<std::endl;
	std::cout << "18074102 左帅 上机题三\n";
	std::cout << "请输入表达式类型 中缀0前缀1后缀2\n0\n";
	std::cout << "请输入表达式\n";
	std::cout << "5+6*3/4-7+9\n";
	std::cout << "             +\n       -         9\n   +       7\n5     /\n    *   4\n   6 3\n";
	std::cout << "中缀表达式为5+6*3/4-7+9\n前缀表达式为+-+5/*63479\n后缀表达式为563*4/+7-9+\n" << std::endl;

}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
